src/InformationRegisters/USAC_СоответствиеОбъектовИдентификаторам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>USAC_СоответствиеОбъектовИдентификаторам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступнаПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.USAC_ВидыПроизвольныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.USAC_ИдентификаторыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Comment>Служебное поле</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/USAC_СлужебныйСерверВызовСервера/Ext/Module.bsl
// Функция создает запись регистра сведений "USAC_СоответствиеОбъектовИдентификаторам"
// При наличии уникального идентификатора он будет установлен в измерение записи, 
// Если идентификатора нет, будет сгенерирован новый уникальный идентификатор
//
// Параметры:
//	ИдентификаторОбъекта - СправочникСсылка.USAC_ИдентификаторыОбъектов, ссылка на идентификатор объекта, по которому необходимо установить запись
//	УникальныйИдентификатор - Строка, УникальныйИдентификатор, Неопределено. Это идентификатор записи, если его нет - будет сгенерирован новый.
//	Замещать - Булево, если "Истина" и запись переданными ключевыми полями уже существует она будет перезаписана, в противном случае запись будет отменена.
//
// Возвращаемое значение:
//	СтруктураКлючейЗаписи - Структура, в качестве ключей выступают измерения регистра сведений "USAC_СоответствиеОбъектовИдентификаторам", 
//	в качестве значений значения новой, созданной записи, может быть использовано, что бы открыть форму регистра или для иных целей.
//	В структуре так-же есть ключ "Результат" и описание ошибки, если запись создана принимает значение "Результат" = "Истина", 
//	если запись не создана "Результат" = "Ложь", а в ключе "ОписаниеОшибки" указывается причина невозможности создания записи.
//
Функция СоздатьЗаписьСоответствияОбъектовИдентификаторам(ИдентификаторОбъекта, УникальныйИдентификатор = Неопределено, Замещать = Истина) Экспорт

	// Генерация структуры записи
	СтруктураКлючейЗаписи = Новый Структура("ИдентификаторОбъекта,УникальныйИдентификатор,Результат,ОписаниеОшибки", 
		Справочники.USAC_ИдентификаторыОбъектов.ПустаяСсылка(), 
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"), 
		Ложь,
		"");
		
	// Проверка на заполненность идентификатора объекта
	Если ТипЗнч(ИдентификаторОбъекта) <> Тип("СправочникСсылка.USAC_ИдентификаторыОбъектов")
		ИЛИ ИдентификаторОбъекта = Справочники.USAC_ИдентификаторыОбъектов.ПустаяСсылка() Тогда 
		СтруктураКлючейЗаписи.ОписаниеОшибки = "Не заполнен идентификатор объекта";
		Возврат СтруктураКлючейЗаписи;
	КонецЕсли;	
	
	// Создание записи
	МенеджерЗаписи = РегистрыСведений.USAC_СоответствиеОбъектовИдентификаторам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторОбъекта = ИдентификаторОбъекта;
	
	Если УникальныйИдентификатор = Неопределено Тогда 
		МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор();
	ИначеЕсли ТипЗнч(УникальныйИдентификатор) = Тип("УникальныйИдентификатор") Тогда 
		МенеджерЗаписи.УникальныйИдентификатор = УникальныйИдентификатор;
	ИначеЕсли ТипЗнч(УникальныйИдентификатор) = Тип("Строка") Тогда 
	  	МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	Иначе 
		СтруктураКлючейЗаписи.ОписаниеОшибки = "Неправильное значение уникального идентификатора записи";
		Возврат СтруктураКлючейЗаписи;
	КонецЕсли;	
	
	Попытка
		МенеджерЗаписи.Записать(Замещать);
		ЗаполнитьЗначенияСвойств(СтруктураКлючейЗаписи, МенеджерЗаписи, "ИдентификаторОбъекта,УникальныйИдентификатор");
		СтруктураКлючейЗаписи.Результат = Истина;
	Исключение
		СтруктураКлючейЗаписи.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;	
	
	Возврат СтруктураКлючейЗаписи;
	
КонецФункции
